[
  {
    "id": 18,
    "category": "perso",
    "title": "Portfolio",
    "date": "01/2025",
    "technologies": ["Next.js", "React", "TailwindCSS", "TypeScript"],
    "filters": {
      "technologies": ["Next.js", "React", "TailwindCSS", "TypeScript"]
    },
    "resume": "Une interface moderne et responsive mettant en avant mes projets et compétences en développement web.",
    "description": "Site personnel développé en Next.js, Hero UI et TailwindCSS, rassembleant mes projets et mes informations personnelles. Il reflète mon évolution en développement web moderne, en mettant l'accent sur des designs responsives et une gestion flexible des thèmes. Ce projet m'a permis de consolider mes compétences tout en explorant de nouvelles approches créatives.",

    "url": "https://sandrinealcazar.ovh",
    "image": "/images/projects_thumbnails/portfolio.png",
    "github": "https://github.com/Vanda89/Portfolio"
  },

  {
    "id": 17,
    "category": "perso",
    "title": "KidsBook Adventures",
    "date": "10/2024",
    "technologies": [
      "Next.js",
      "React",
      "TailwindCSS",
      "NextUI",
      "OpenAI",
      "TypeScript",
      "MongoDB"
    ],
    "filters": {
      "technologies": [
        "Next.js",
        "React",
        "TailwindCSS",
        "NextUI",
        "OpenAI",
        "TypeScript"
      ]
    },
    "resume": "Application web permettant de générer des histoires personnalisées pour enfants grâce à l'IA.",
    "description": "Application web génèrant des histoires personnalisées pour enfants avec OpenAI. L'application utilise un design kawaii, un système de thèmes colorés et une expérience utilisateur ludique.",
    "url": "https://kidsbookadventures.sandrinealcazar.ovh",
    "image": "/images/projects_thumbnails/kidsbook_adventures.png",
    "github": "https://github.com/Vanda89/KidsBook_Adventures"
  },

  {
    "id": 16,
    "category": "dev js",
    "title": "Wealth Health",
    "date": "10/2024",
    "technologies": ["TailwindCSS", "React", "Redux"],
    "filters": {
      "technologies": ["TailwindCSS", "React", "Redux"]
    },
    "resume": "Refonte d'une application interne de jquery à React pour améliorer performances et accessibilité.",
    "description": "WealthHealth est un projet de modernisation d’une application interne de gestion des dossiers employés (HRnet). L'objectif était de convertir l'application de jQuery à React, tout en améliorant ses performances, son accessibilité et son design. Ce projet met en évidence la transition d’une technologie obsolète à une pile moderne et performante, tout en résolvant des problèmes d’ergonomie et de stabilité pour les utilisateurs.",
    "url": "https://wealth-health.sandrinealcazar.ovh",
    "image": "/images/projects_thumbnails/wealth-health.png",
    "github": "https://github.com/Vanda89/WealthHealth"
  },

  {
    "id": 15,
    "category": "dev js",
    "title": "Argent Bank",
    "date": "08/2024",
    "technologies": [
      "TailwindCSS",
      "React",
      "Redux",
      "Swagger",
      "NodeJS",
      "MongoDB"
    ],
    "filters": {
      "technologies": ["TailwindCSS", "React", "Redux", "NodeJS"]
    },
    "resume": "Intégration d'une API pour un compte utilisateur bancaire et définition des endpoints avec Swagger",
    "description": "ArgentBank est une application bancaire en ligne offrant une gestion sécurisée des comptes bancaires. Ce projet inclut l'authentification des utilisateurs, la gestion des profils et des comptes via une interface moderne et responsive. Il prépare également une extension API pour la gestion des transactions (visualisation, modification, suppression).",
    "url": "https://argentbank.sandrinealcazar.ovh/",
    "image": "/images/projects_thumbnails/argentbank.png",
    "github": "https://github.com/Vanda89/ArgentBank"
  },

  {
    "id": 14,
    "category": "dev js",
    "title": "Sport See",
    "date": "07/2024",
    "technologies": ["React", "Recharts", "TailwindCSS", "NodeJS"],
    "filters": {
      "technologies": ["React", "Recharts", "TailwindCSS", "NodeJS"]
    },
    "resume": "Tableau de bord interactif d'analystics des performances sportives",
    "description": "SportSee est une application React dédiée à l’analyse des performances sportives. Elle utilise Recharts pour afficher des graphiques dynamiques des sessions d’entraînement et des calories brûlées. Le projet intègre Axios pour récupérer les données d'une API backend, et offre une interface utilisateur intuitive permettant aux utilisateurs de suivre leurs progrès via un tableau de bord interactif.",
    "url": "https://sportsee.sandrinealcazar.ovh",
    "image": "/images/projects_thumbnails/sportsee.png",
    "github": "https://github.com/Vanda89/SportSee"
  },
  {
    "id": 13,
    "category": "dev js",
    "title": "Kasa",
    "date": "06/2024",
    "technologies": ["React", "React Router", "TailwindCSS"],
    "filters": {
      "technologies": ["React", "TailwindCSS"]
    },
    "resume": "Plateforme React dédiée à la location de logements entre particuliers. ",
    "description": "Kasa est une plateforme de location de logements développée en React. L'application utilise React Router pour une navigation fluide et dynamique. Elle récupère les données d'une API pour afficher les annonces, les galeries photo et les évaluations. L'interface est responsive, offrant une expérience optimale sur tous les appareils.",
    "url": "https://kasa.sandrinealcazar.ovh",
    "image": "/images/projects_thumbnails/kasa.png",
    "github": "https://github.com/Vanda89/Kasa"
  },
  {
    "id": 12,
    "category": "dev js",
    "title": "Learn@home",
    "date": "04/2024",
    "technologies": ["Figma", "Notion", "Draw.io"],
    "filters": {
      "technologies": []
    },
    "resume": "Définition des besoins et conception de maquettes pour une plateforme de soutien scolaire. ",
    "description": "Learn@home est un projet de conception d’une plateforme de soutien scolaire. Le projet inclut des maquettes sur Figma, des user stories et des diagrammes de cas d’usage. L’objectif est de définir les besoins d'enfants en difficulté scolaire et des tuteurs bénévoles, avec des fonctionnalités comme le chat, le calendrier et le tableau de bord.",
    "url": "https://www.figma.com/design/AjDV7imr4r4IGSE1fYwhEI/Learn%40home?node-id=0-1&m=dev&t=uA6sl25XH8Kfg5Nh-1",
    "image": "/images/projects_thumbnails/learn@home.png",
    "github": "https://github.com/Vanda89/Learn-home"
  },
  {
    "id": 11,
    "category": "dev js",
    "title": "Billed",
    "date": "03/2024",
    "technologies": ["JavaScript", "Chrome Debugger", "Notion", "NodeJS"],
    "filters": {
      "technologies": ["JavaScript", "NodeJS"]
    },
    "resume": "Déboggage et correction de bugs dans un projet de formation SaaS. ",
    "description": "Billed est un projet de formation axé sur la fonctionnalité Note de frais au sein d'une entreprise SaaS. Le projet a consisté à tester et déboguer le parcours Employé en suivant un plan de tests End-to-End, corriger les bugs dans le Kanban, et valider la fiabilité du système. Une participation a également eu lieu dans la correction des bugs du parcours Administrateur RH pour garantir la stabilité avant la présentation de la solution.",
    "url": "https://billed.sandrinealcazar.ovh/",
    "image": "/images/projects_thumbnails/billed.png",
    "github": "https://github.com/Vanda89/BilledApp"
  },

  {
    "id": 10,
    "category": "dev js",
    "title": "Les petits plats",
    "date": "02/2024",
    "technologies": ["JavaScript", "TailwindCSS"],
    "filters": {
      "technologies": ["JavaScript", "TailwindCSS"]
    },
    "resume": "Création d'un algorithme de recherche de recettes pour une application web. ",
    "description": "Les Petits Plats est une application web permettant de rechercher des recettes grâce à des filtres dynamiques (ingrédients, appareils, ustensiles) et un champ de recherche optimisé. Développée en JavaScript pur avec HTML/CSS et CSS, l'application gère efficacement les recherches et le filtrage avancé pour offrir une expérience fluide même avec une base de données importante.",
    "url": "https://lespetitsplats.sandrinealcazar.ovh",
    "image": "/images/projects_thumbnails/lespetitsplats.png",
    "github": "https://github.com/Vanda89/Lespetitsplats"
  },

  {
    "id": 9,
    "category": "dev js",
    "title": "FishEye",
    "date": "01/2024",
    "technologies": ["HTML/CSS", "JavaScript"],
    "filters": {
      "technologies": ["HTML/CSS", "JavaScript"]
    },
    "resume": "Plateforme dédiée à la photographie, permettant aux utilisateurs d'explorer les portfolios de photographes professionnels.",
    "description": "FishEye est une plateforme dédiée à la photographie, permettant aux utilisateurs d'explorer les portfolios de photographes professionnels. Le projet offre un tri des médias par popularité, date ou titre, une visionneuse interactive des galeries et un formulaire de contact. Développé avec HTML/CSS, CSS et JavaScript, FishEye propose une expérience utilisateur fluide et accessible.",
    "url": "https://fisheye.sandrinealcazar.ovh",
    "image": "/images/projects_thumbnails/fisheye.png",
    "github": "https://github.com/Vanda89/Fisheye"
  },
  {
    "id": 8,
    "category": "dev js",
    "title": "GameOn",
    "date": "11/2023",
    "technologies": ["HTML/CSS", "JavaScript"],
    "filters": {
      "technologies": ["HTML/CSS", "JavaScript"]
    },
    "resume": " Implémentation d’un formulaire d’inscription pour un tournoi de jeux vidéo, avec validation des champs et gestion des erreurs. ",
    "description": "GameOn est une plateforme de gestion des inscriptions pour des tournois de jeux vidéo. Le projet a consisté à optimiser et finaliser un formulaire d'inscription en ajoutant des fonctionnalités JavaScript manquantes, améliorant le code existant, validant les entrées utilisateur, et assurant la compatibilité responsive. Des tests manuels ont été réalisés pour garantir la stabilité et une documentation détaillée a été fournie.",
    "url": "https://gameon.sandrinealcazar.ovh",
    "image": "/images/projects_thumbnails/gameon.png",
    "github": "https://github.com/Vanda89/GameOn"
  },
  {
    "id": 7,
    "category": "dev js",
    "title": "OhmyFood",
    "date": "10/2023",
    "technologies": ["SCSS"],
    "filters": {
      "technologies": ["SCSS"]
    },
    "resume": "Application web statique, moderne et responsive, mettant en avant des menus de restaurants gastronomiques.",
    "description": "OhMyFood est une application web statique présentant des menus de restaurants gastronomiques. Le projet a visé à créer une interface moderne et responsive avec des animations CSS pour une expérience utilisateur engageante. Il a impliqué la conception de pages statiques présentant les menus de manière interactive.",
    "url": "https://ohmyfood.sandrinealcazar.ovh",
    "image": "/images/projects_thumbnails/ohmyfood.png",
    "github": "https://github.com/Vanda89/ohmyfood"
  },

  {
    "id": 6,
    "category": "dev js",
    "title": "Booki",
    "date": "09/2023",
    "technologies": ["HTML/CSS"],
    "filters": {
      "technologies": ["HTML/CSS"]
    },
    "resume": "Site vitrine visant à rechercher des hébergements et des activités touristiques selon la destination. ",
    "description": "Booki est un projet de site web statique visant à permettre aux utilisateurs de rechercher des hébergements et des activités touristiques selon leur destination. Le projet avait pour objectif de concevoir une interface moderne, responsive et accessible, avec une mise en page soignée conforme aux maquettes fournies.",
    "url": "https://booki.sandrinealcazar.ovh",
    "image": "/images/projects_thumbnails/booki.png",
    "github": "https://github.com/Vanda89/Booki"
  },
  {
    "id": 5,
    "category": "dev web",
    "title": "L'univers Fabuleux",
    "date": "08/2018",
    "technologies": [
      "HTML/CSS",
      "JavaScript",
      "PHP",
      "Bootstrap",
      "jquery",
      "MySQL"
    ],
    "filters": {
      "technologies": [
        "HTML/CSS",
        "JavaScript",
        "PHP",
        "Bootstrap",
        "jquery",
        "MySQL"
      ]
    },
    "resume": "Site de jeux pour enfants en mobile first avec espace personnel personnalisable. ",
    "description": "L'univers Fabuleux est un site de jeux mobile-first pour enfants, offrant un espace personnel personnalisable. Il inclut des jeux interactifs, tels qu'un jeu de Memory et un jeu de Tape lettre au clavier, conçus pour aider les enfants à développer leur mémoire et leur rapidité. Le projet comprend également une interface admin permettant d'ajouter, modifier et supprimer des éléments du site de manière dynamique.",
    "url": "https://univers-fabuleux.sandrinealcazar.ovh",
    "image": "/images/projects_thumbnails/univers-fabuleux.png",
    "github": "https://github.com/Vanda89/Univers_Fabuleux"
  },
  {
    "id": 4,
    "category": "dev web",
    "title": "Jean Forteroche",
    "date": "06/2018",
    "technologies": ["HTML/CSS", "PHP", "MySQL"],
    "filters": {
      "technologies": ["HTML/CSS", "PHP", "MySQL"]
    },
    "resume": "Blog pour un écrivain avec intégration d'un système de CRUD pour la partie admin, et de commentaires pour la partie user. ",
    "description": "Le site de Jean Forteroche est un blog développé pour un écrivain, avec un système de CRUD pour l'admin afin de gérer les articles, et une fonctionnalité de commentaires pour les utilisateurs. Ce projet utilise une architecture MVC avec une base de données MySQL pour stocker les articles et commentaires. Il dispose d'une gestion efficace du contenu tout en offrant une expérience utilisateur simple et intuitive.",
    "url": "https://blog-jean-forteroche.sandrinealcazar.ovh",
    "image": "/images/projects_thumbnails/blog-jean-forteroche.png",
    "github": "https://github.com/Vanda89/Blog_jean_forteroche"
  },
  {
    "id": 3,
    "category": "dev web",
    "title": "Velo'v Me Lyon",
    "date": "05/2018",
    "technologies": ["HTML/CSS", "JavaScript", "jquery"],
    "filters": {
      "technologies": ["HTML/CSS", "JavaScript", "jquery"]
    },
    "resume": "Application web interactive pour la gestion des locations de vélos. ",
    "description": "Velo'v Me Lyon est une simulation d'application web responsive qui permet aux utilisateurs de localiser et de réserver des vélos à Lyon. L'objectif est de fournir une interface claire et intuitive, permettant de trouver rapidement les stations les plus proches, de consulter la disponibilité des vélos et des emplacements, et d'effectuer une réservation en quelques clics. Ce projet a été conçu à des fins d'apprentissage du JavaScript",
    "url": "https://velovme-lyon.sandrinealcazar.ovh/",
    "image": "/images/projects_thumbnails/velovme.png",
    "github": "https://github.com/Vanda89/Velo-v-me-Lyon"
  },
  {
    "id": 2,
    "category": "dev web",
    "title": "Strasbourg",
    "date": "04/2018",
    "technologies": ["Wordpress"],
    "filters": {
      "technologies": ["Wordpress"]
    },
    "resume": "Version Wordpress fonctionnelle simulant le site internet de l'Office de Tourisme de Strasbourg. ",
    "description": "Strasbourg est une application WordPress fonctionnelle créée pour simuler un site de l'Office de Tourisme de Strasbourg. Le projet visait à concevoir un site mettant en avant les attraits touristiques de la ville, tout en respectant un cahier des charges précis. L'objectif était de créer une interface claire et intuitive, avec un design attractif, tout en personnalisant le thème WordPress choisi. ",
    "url": "https://strasbourg.sandrinealcazar.ovh",
    "image": "/images/projects_thumbnails/strasbourg.png",
    "github": "https://github.com/Vanda89/Strasbourg"
  },
  {
    "id": 1,
    "category": "dev web",
    "title": "Webagency",
    "date": "03/20",
    "technologies": ["HTML/CSS"],
    "filters": {
      "technologies": ["HTML/CSS"]
    },
    "resume": "Maquette fonctionnelle pour un site d'agence web respectant les bonnes pratiques de responsive design et d'accessibilité.",
    "description": "Webagency est une maquette fonctionnelle d'un site pour une agence web, développée uniquement en HTML/CSS et CSS. Le projet met l'accent sur l'application des bonnes pratiques de responsive design et d'accessibilité pour offrir une expérience utilisateur optimale sur tous les appareils.",
    "url": "https://webagency.sandrinealcazar.ovh",
    "image": "/images/projects_thumbnails/webagency.png",
    "github": "https://github.com/Vanda89/Webagency"
  }
]
